1. Create two dataframes :
name =c('Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas')
score =c(12.5, 9, 16.5, 12, 9, 20, 14.5, 13.5, 8, 19)
attempts = c(1, NA, 2, NA, 2, NA, 1, NA, 2, 1)
pass =c('yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes')

a. Write a R program to extract 3rd and 5th rows with 1st and 3rd columns from a given data frame.
b. Write a R program to replace NA values with 3 in a given data frame.
c. Get the statistical summary and nature of the data
d. Write a R Program to extract score greater than 9
e. Rename the pass column to Qualify.
f. Sort the data in ascending order.
g. Find Maximum Score.
h. Add new row of data



2.Create a function that will return the sum of 2 integers.


3. Create a vector strings <- c("ab9", "ab", "abc8", "abc")  and implement the required pattern for finding any digit in the vector. Use function grepl to verify if there is a digit.


 4. Write mtcars dataset into a CSV file named example.csv , Read the same file content and display the data

5.  Read the Sample-sales data.excel file and display the top 10 rows.

In [2]:
#1
name =c('Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas') 
score =c(12.5, 9, 16.5, 12, 9, 20, 14.5, 13.5, 8, 19) 
attempts = c(1, NA, 2, NA, 2, NA, 1, NA, 2, 1) 
pass =c('yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes')
df1=data.frame(name,score)
df2=data.frame(attempts,pass)
df1

   name      score
1  Anastasia 12.5
2  Dima       9.0
3  Katherine 16.5
4  James     12.0
5  Emily      9.0
6  Michael   20.0
7  Matthew   14.5
8  Laura     13.5
9  Kevin      8.0
10 Jonas     19.0

In [3]:
df2

   attempts pass
1   1       yes
2  NA       no
3   2       yes
4  NA       no
5   2       no
6  NA       yes
7   1       yes
8  NA       no
9   2       no
10  1       yes

In [1]:
df=data.frame(name =c('Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas') 
              ,score =c(12.5, 9, 16.5, 12, 9, 20, 14.5, 13.5, 8, 19) 
              ,attempts = c(1, NA, 2, NA, 2, NA, 1, NA, 2, 1) 
              ,pass =c('yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'))
#a. Write a R program to extract 3rd and 5th rows with 1st and 3rd columns from a given data frame.
a=df[c(3,5),c(1,3)]
a

  name      attempts
3 Katherine 2
5 Emily     2

In [2]:
#b. Write a R program to replace NA values with 3 in a given data frame.
df[is.na(df)]=3
df

   name      score attempts pass
1  Anastasia 12.5  1        yes
2  Dima       9.0  3        no
3  Katherine 16.5  2        yes
4  James     12.0  3        no
5  Emily      9.0  2        no
6  Michael   20.0  3        yes
7  Matthew   14.5  1        yes
8  Laura     13.5  3        no
9  Kevin      8.0  2        no
10 Jonas     19.0  1        yes

In [3]:
#c. Get the statistical summary and nature of the data
summary(df)

        name       score          attempts     pass
 Anastasia:1   Min.   : 8.00   Min.   :1.00   no :5
 Dima     :1   1st Qu.: 9.75   1st Qu.:1.25   yes:5
 Emily    :1   Median :13.00   Median :2.00
 James    :1   Mean   :13.40   Mean   :2.10
 Jonas    :1   3rd Qu.:16.00   3rd Qu.:3.00
 Katherine:1   Max.   :20.00   Max.   :3.00
 (Other)  :4

In [4]:
#d. Write a R Program to extract score greater than 9
subset(df, score>9)

   name      score attempts pass
1  Anastasia 12.5  1        yes
3  Katherine 16.5  2        yes
4  James     12.0  3        no
6  Michael   20.0  3        yes
7  Matthew   14.5  1        yes
8  Laura     13.5  3        no
10 Jonas     19.0  1        yes

In [42]:
#e. Rename the pass column to Qualify.
names(df)[names(df)=="pass"]="qualify"
df

   name      score attempts qualify
1  Anastasia 12.5  1        yes
2  Dima       9.0  3        no
3  Katherine 16.5  2        yes
4  James     12.0  3        no
5  Emily      9.0  2        no
6  Michael   20.0  3        yes
7  Matthew   14.5  1        yes
8  Laura     13.5  3        no
9  Kevin      8.0  2        no
10 Jonas     19.0  1        yes

In [47]:
#f. Sort the data in ascending order.
sort=order(df['score'])
df[sort,]

   name      score attempts qualify
9  Kevin      8.0  2        no
2  Dima       9.0  3        no
5  Emily      9.0  2        no
4  James     12.0  3        no
1  Anastasia 12.5  1        yes
8  Laura     13.5  3        no
7  Matthew   14.5  1        yes
3  Katherine 16.5  2        yes
10 Jonas     19.0  1        yes
6  Michael   20.0  3        yes

In [48]:
#g. Find Maximum Score.
max(df['score'])

[1] 20

In [54]:
#h. Add new row of data
df=data.frame(name =c('Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas') 
              ,score =c(12.5, 9, 16.5, 12, 9, 20, 14.5, 13.5, 8, 19) 
              ,attempts = c(1, NA, 2, NA, 2, NA, 1, NA, 2, 1) 
              ,pass =c('yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'))
df=rbind(df,new=c('Barney',19,1,'yes'))
df

Warning message in `[<-.factor`(`*tmp*`, ri, value = "Barney"):
"invalid factor level, NA generated"

   name      score attempts pass
1  Anastasia 12.5  1        yes
2  Dima      9     NA       no
3  Katherine 16.5  2        yes
4  James     12    NA       no
5  Emily     9     2        no
6  Michael   20    NA       yes
7  Matthew   14.5  1        yes
8  Laura     13.5  NA       no
9  Kevin     8     2        no
10 Jonas     19    1        yes
11 NA        19    1        yes

In [57]:
#2
sum=function(a,b){
    sum=a+b
    sum
}
sum(2,3)

[1] 5

In [59]:
#Create a vector strings <- c("ab9", "ab", "abc8", "abc") and implement the required pattern for finding any digit in the vector. Use function grepl to verify if there is a digit.
chars = c("ab9", "ab", "abc8", "abc")
grep(x=chars ,pattern= '[0-9]')

[1] 1 3

In [65]:
#Write mtcars dataset into a CSV file named example.csv , Read the same file content and display the data
data=write.csv(mtcars,"example.csv")

In [66]:
#Read the Sample-sales data.excel file and display the top 10 rows.
data2=read.csv("Sample-Sales-Data.csv")
data2

    Postcode Sales_Rep_ID Sales_Rep_Name Year Value   X
1   2121     456          Jane           2011 $84,219 NA
2   2092     789          Ashish         2012 $28,322 NA
3   2128     456          Jane           2013 $81,879 NA
4   2073     123          John           2011 $44,491 NA
5   2134     789          Ashish         2012 $71,838 NA
6   2162     123          John           2013 $64,532 NA
7   2093     456          Jane           2011 $58,963 NA
8   2042     789          Ashish         2012 $27,522 NA
9   2198     123          John           2013 $77,985 NA
10  2043     789          Ashish         2011 $49,546 NA
11  2025     789          Ashish         2012 $17,734 NA
12  2045     456          Jane           2013 $91,126 NA
13  2090     456          Jane           2011 $48,113 NA
14  2114     456          Jane           2012 $28,361 NA
15  2142     456          Jane           2013 $50,912 NA
16  2062     123          John           2011 $75,539 NA
17  2049     456          Jane           2012 $96,922 NA
18  2204     456          Jane           2013 $57,838 NA
19  2000     456          Jane           2011 $4,530  NA
20  2135     123          John           2012 $27,761 NA
21  2115     456          Jane           2013 $22,773 NA
22  2032     789          Ashish         2011 $98,780 NA
23  2068     456          Jane           2012 $66,044 NA
24  2119     789          Ashish         2013 $32,882 NA
25  2060     456          Jane           2011 $75,822 NA
26  2072     456          Jane           2012 $36,675 NA
27  2045     123          John           2013 $95,817 NA
28  2140     456          Jane           2011 $43,627 NA
29  2205     789          Ashish         2012 $93,306 NA
30  2060     123          John           2013 $71,322 NA
... ...      ...          ...            ...  ...     ...
970 NA       NA                          NA           NA
971 NA       NA                          NA           NA
972 NA       NA                          NA           NA
973 NA       NA                          NA           NA
974 NA       NA                          NA           NA
975 NA       NA                          NA           NA
976 NA       NA                          NA           NA
977 NA       NA                          NA           NA
978 NA       NA                          NA           NA
979 NA       NA                          NA           NA
980 NA       NA                          NA           NA
981 NA       NA                          NA           NA
982 NA       NA                          NA           NA
983 NA       NA                          NA           NA
984 NA       NA                          NA           NA
985 NA       NA                          NA           NA
986 NA       NA                          NA           NA
987 NA       NA                          NA           NA
988 NA       NA                          NA           NA
989 NA       NA                          NA           NA
990 NA       NA                          NA           NA
991 NA       NA                          NA           NA
992 NA       NA                          NA           NA
993 NA       NA                          NA           NA
994 NA       NA                          NA           NA
995 NA       NA                          NA           NA
996 NA       NA                          NA           NA
997 NA       NA                          NA           NA
998 NA       NA                          NA           NA
999 NA       NA                          NA           NA